[
    {
        "id": "CRITERION_1",
        "name": "ANALYYSI JA PROSESSIN TEHOKKUUS (Bloom: Analyze)",
        "levels": {
            "4": "Erinomainen / Strateginen:\n- Prosessi on strateginen ja ennakoiva. Käyttäjä on purkanut ongelman osiin ja ohjannut tekoälyä ennaltaehkäisevästi (esim. roolilla, analyysipakolla, rajoitteilla) minimoiden turhat iteraatiot.\n- TAI Prosessi osoittaa poikkeuksellista strategista ketteryyttä. Käyttäjä on tehnyt prosessin aikana merkittävän oivalluksen, joka on perustavanlaatuisesti ja todistettavasti muuttanut tehtävän suuntaa tai laatua. Reflektio perustelee tämän käännekohdan strategisen merkityksen.",
            "3": "Hyvä / Omaperäinen:\n- Prosessi on tehokas ja systemaattinen. Käyttäjä on tunnistanut ongelman ja ohjannut tekoälyä reaktiivisesti mutta johdonmukaisesti (esim. pyytämällä parannuksia). Reflektio analysoi käännekohdat.",
            "2": "Kohtalainen / Reaktiivinen:\n- Prosessi on hajanainen tai puhtaasti reaktiivinen. Käyttäjä on reagoinut tekoälyn vastauksiin, mutta selkeä analyyttinen strategia puuttuu tai on heikko. Iteraatioita voi olla useita ilman merkittävää laadullista parannusta. Reflektio on pääosin kuvaileva.",
            "1": "Heikko / Puutteellinen:\n- Prosessi on tehoton ja epälooginen. Käyttäjä ei ole kyennyt ohjaamaan tekoälyä kohti tavoitetta. Reflektio on puutteellinen tai puuttuu kokonaan."
        }
    },
    {
        "id": "CRITERION_2",
        "name": "ARVIOINTI JA ARGUMENTAATIO (Anderson & Krathwohl: Evaluate; Toulmin)",
        "levels": {
            "4": "Erinomainen / Strateginen:\n- Suoritus osoittaa poikkeuksellista arviointikykyä. Käyttäjä on haastanut tekoälyn päättelyä (esim. eettisesti tai loogisesti).\n- TAI (Asiantuntijan Hyväksyntä): Käyttäjä osoittaa poikkeuksellista arviointikykyä perustelemalla reflektiossa vankasti, miksi lyhyt prosessi ja tekoälyn tuotoksen suora hyväksyntä oli strategisesti optimaalinen valinta.\n- Molemmissa tapauksissa Toulmin: Reflektio sisältää vankan, itsekriittisen argumentin, joka on täysin virheetön.",
            "3": "Hyvä / Omaperäinen:\n- Suoritus osoittaa korkeaa arviointikykyä. Käyttäjä on korjannut tekoälyn tuotoksia.\n- Toulmin: Reflektio sisältää vahvan argumentin: Selkeä Väite, Vankat Perusteet (viittaukset Keskusteluhistoriaan) ja Eksplisiittinen Oikeutus. (Tämä sisältää myös tapaukset, joissa lyhyt prosessi perustellaan reflektiossa vahvalla asiantuntija-argumentilla.)",
            "2": "Kohtalainen / Reaktiivinen:\n- Suoritus osoittaa perustason arviointikykyä. Käyttäjä on tehnyt pieniä korjauksia.\n- Toulmin: Reflektio sisältää argumentin aihion: Väite on esitetty, mutta Perusteet ovat yleisiä ja/tai Oikeutus on implisiittinen tai heikko.",
            "1": "Heikko / Puutteellinen:\n- Suoritus ei osoita arviointikykyä. Tekoälyn tuotoksia on käytetty sellaisenaan.\n- Toulmin: Reflektio ei sisällä tunnistettavaa, pätevää argumenttia ja/tai se on kokonaisuudessaan faktuaalisesti virheellinen tai harhaanjohtava."
        }
    },
    {
        "id": "CRITERION_3",
        "name": "SYNTEESI JA LUOVUUS (Bloom: Create)",
        "levels": {
            "4": "Erinomainen / Strateginen:\n- Lopputuote osoittaa strategista synteesiä. Käyttäjä on luonut kokonaan uutta, omaperäistä lisäarvoa, jota tekoäly ei ehdottanut (esim. lisännyt uuden vastuullisuusosion). Reflektio perustelee tämän strategisen lisäarvon.",
            "3": "Hyvä / Omaperäinen:\n- Lopputuote on omaperäinen synteesi. Käyttäjä on parannellut ja viimeistellyt tekoälyn tuotosta omalla perustellulla panoksellaan (esim. lisännyt hyötyjä, vaihtanut otsikon). Reflektio perustelee muutokset.",
            "2": "Kohtalainen / Reaktiivinen:\n- Lopputuote on pääosin kooste tekoälyn tuottamasta materiaalista. Muutokset ovat kielellistä viimeistelyä tai pieniä lisäyksiä. Reflektio kuvaa tehdyt muutokset pinnallisesti.",
            "1": "Heikko / Puutteellinen:\n- Lopputuote on suora kopio tekoälyn tuottamasta materiaalista ilman omaa panosta. Reflektio on puutteellinen tai puuttuu."
        }
    }
]